In [1]:
import numpy as np
import pandas as pd

# Series / Seriler

In [2]:
# numpy dizisine cok benzeyen yapilardir
# pandas veri biliminin exceli olarak da gecer
# serilerden, numpy diz ilerinden, listlerden bir cok seyden olusturulabilir

# dict ile olusturulma
myDict = {'Furkan': 50, 'Hamza': 40, 'Ali': 30}
print(pd.Series(myDict))

print('\n')

# array ile
myAgeArr = [50,40,30]
myNameArr = ['Furkan', 'Hamza', 'Ali']
print(pd.Series(data = myAgeArr, index = myNameArr)) # burada data ve index degerleri belirtmesek de calisir fakat belirtmekte fayda var

print('\n')

#numpy dizisi ile
numpyArr = np.array([50,40,30])
print(pd.Series( data = numpyArr, index = myNameArr))

Furkan    50
Hamza     40
Ali       30
dtype: int64


Furkan    50
Hamza     40
Ali       30
dtype: int64


Furkan    50
Hamza     40
Ali       30
dtype: int32

In [3]:
# data el ile de girilebilir
pd.Series(data = ['Furkan', 'Hamza', 'Ali'], index = [1,2,3])

1    Furkan
2     Hamza
3       Ali
dtype: object

In [4]:
# 2 tane seri tanimlayip bunlar uzerinde islemler yapalim
yarismaSonucu1 = pd.Series(data = [10,5,1], index = ['Furkan', 'Hamza', 'Ali'])
print(yarismaSonucu1)

print('\n')

yarismaSonucu2 = pd.Series(data = [20,10,8], index = ['Furkan', 'Hamza', 'Ali'])
print(yarismaSonucu2)

Furkan    10
Hamza      5
Ali        1
dtype: int64


Furkan    20
Hamza     10
Ali        8
dtype: int64

In [5]:
# yarismaSonucu2 de Hamzanin kac puan aldigina bakalim
print(yarismaSonucu2['Hamza']) # index numarasi yerine dogrudan istedigimiz veriyi yaziyoruz

# 2 sonucu birlestirelim
sonSonuc = yarismaSonucu1 + yarismaSonucu2
print(sonSonuc)

10
Furkan    30
Hamza     15
Ali        9
dtype: int64

In [6]:
# yukardakinin aksine farkli index degerleri iceren iki series toplansin
farkliSeries = pd.Series(data = [20,30,40,50], index = ['a','b','c','d'])
farkliSeries2 = pd.Series(data = [10,5,3,1], index = ['a','c','f','g'])

# ikisinde ortak olmayan degerleri buldugu zaman NaN vercek
sonuc = farkliSeries + farkliSeries2
print(sonuc)

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

# DataFrame

In [7]:
# DataFrame'leri Serilerin birlestirilmis hali olarak dusunebiliriz
# oncelikle islem yapabilmek icin bir veri olusturalim
data = np.random.rand(4,3)

In [8]:
dataFrame = pd.DataFrame(data)

dataFrame

          0         1         2
0  0.702464  0.624137  0.540949
1  0.754901  0.685438  0.694400
2  0.776928  0.670241  0.719130
3  0.797701  0.858056  0.861951

In [9]:
# index yazarsak yazdigimiz index ile KOLON'u bize getirecektir
dataFrame[0]

0    0.702464
1    0.754901
2    0.776928
3    0.797701
Name: 0, dtype: float64

In [10]:
# yeni bir dataFrame olusturup index ve labellari elle girelim
# index adlari icin [index] kolon adlari icin [columns] kullancaz
newDataFrame = pd.DataFrame(data, index = ['Furkan','Hamza','Ali','Ayse'], columns = ['Maas','Yas','Calisma Saati'])

newDataFrame

            Maas       Yas  Calisma Saati
Furkan  0.702464  0.624137       0.540949
Hamza   0.754901  0.685438       0.694400
Ali     0.776928  0.670241       0.719130
Ayse    0.797701  0.858056       0.861951

In [11]:
# ornek olmasi amaciyla veriler cekelim bundan
print(newDataFrame['Yas'])
print('\n')

print(newDataFrame['Calisma Saati'])
print('\n')

# 2 kolon degerindeki verileri istiyorum
print(newDataFrame[['Maas', 'Yas']])
print('\n')

# kolon yerine index deki isimlerden birinin verileri getirelim [.loc kullancaz]
# Furkanin verileri gelsin
print(newDataFrame.loc['Furkan'])
print('\n')

# veya dogrudan index numarasini kullanarak cagirabiliriz [iloc]
print(newDataFrame.iloc[1])

Furkan    0.624137
Hamza     0.685438
Ali       0.670241
Ayse      0.858056
Name: Yas, dtype: float64


Furkan    0.540949
Hamza     0.694400
Ali       0.719130
Ayse      0.861951
Name: Calisma Saati, dtype: float64


            Maas       Yas
Furkan  0.702464  0.624137
Hamza   0.754901  0.685438
Ali     0.776928  0.670241
Ayse    0.797701  0.858056


Maas             0.702464
Yas              0.624137
Calisma Saati    0.540949
Name: Furkan, dtype: float64


Maas             0.754901
Yas              0.685438
Calisma Saati    0.694400
Name: Hamza, dtype: float64

### DataFrame indeksler

In [12]:
newDataFrame

            Maas       Yas  Calisma Saati
Furkan  0.702464  0.624137       0.540949
Hamza   0.754901  0.685438       0.694400
Ali     0.776928  0.670241       0.719130
Ayse    0.797701  0.858056       0.861951

In [13]:
# Yeni kolon ekleme

# emeklilik yasi adinda kolon olusturup degerlerine yas degerlerinin toplamini atayalim
newDataFrame['Emeklilik Yasi'] = newDataFrame['Yas'] + newDataFrame['Yas']
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.702464  0.624137       0.540949        1.248274
Hamza   0.754901  0.685438       0.694400        1.370876
Ali     0.776928  0.670241       0.719130        1.340481
Ayse    0.797701  0.858056       0.861951        1.716112

In [14]:
# silme islemi

# [axis = 0 SATIR] || [axis = 1 SUTUN]
# axis default olarak 0 kabul edilir
newDataFrame.drop('Maas', axis = 1)

             Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.624137       0.540949        1.248274
Hamza   0.685438       0.694400        1.370876
Ali     0.670241       0.719130        1.340481
Ayse    0.858056       0.861951        1.716112

In [15]:
# satir dusurme
newDataFrame.drop('Ali', axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.702464  0.624137       0.540949        1.248274
Hamza   0.754901  0.685438       0.694400        1.370876
Ayse    0.797701  0.858056       0.861951        1.716112

In [16]:
# Her ne kadar silme islemi yapmis olsak da DataFrame i cagirdigimiz zaman silinmemis olarak gozukuyor
print(newDataFrame)
print('\n')

# bunu inplace kullanarak asiyoruz || degisiklikleri dataFrame icinde degistir gibi bir anlami var
newDataFrame.drop('Maas', axis = 1, inplace = True)
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.702464  0.624137       0.540949        1.248274
Hamza   0.754901  0.685438       0.694400        1.370876
Ali     0.776928  0.670241       0.719130        1.340481
Ayse    0.797701  0.858056       0.861951        1.716112

             Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.624137       0.540949        1.248274
Hamza   0.685438       0.694400        1.370876
Ali     0.670241       0.719130        1.340481
Ayse    0.858056       0.861951        1.716112

In [17]:
# DataFrame icinde istenen kisinin istenilen degerini ogrenme
print(newDataFrame.loc['Furkan', 'Yas'])

# farkli kullanimi
print(newDataFrame.loc['Furkan']['Yas'])

0.6241369382174543
0.6241369382174543

In [18]:
# 1 den buyuk olan degerleri bulmak istiyorum
newDataFrame>1

          Yas  Calisma Saati  Emeklilik Yasi
Furkan  False          False            True
Hamza   False          False            True
Ali     False          False            True
Ayse    False          False            True

In [19]:
# degerleri de gorelim || daha once numpy da yapmistik
boolenFrame = newDataFrame > 1
newDataFrame[boolenFrame]

        Yas  Calisma Saati  Emeklilik Yasi
Furkan  NaN            NaN        1.248274
Hamza   NaN            NaN        1.370876
Ali     NaN            NaN        1.340481
Ayse    NaN            NaN        1.716112

In [20]:
# ayni islemi satirlar ile yapalim (indexlerle)
newDataFrame['Emeklilik Yasi'] > 1

Furkan    True
Hamza     True
Ali       True
Ayse      True
Name: Emeklilik Yasi, dtype: bool

In [21]:
# index'i degistirmek isteyebiliriz. Karsimiza gelebilecek senaryoya gore isteklerimiz degisebilir

# reset_index() fonksiyonu ile yeni bir kolon acip onceki index degerlerini buraya atiyor
newDataFrame.reset_index()

    index       Yas  Calisma Saati  Emeklilik Yasi
0  Furkan  0.624137       0.540949        1.248274
1   Hamza  0.685438       0.694400        1.370876
2     Ali  0.670241       0.719130        1.340481
3    Ayse  0.858056       0.861951        1.716112

In [22]:
# bazi durumlarda index degerleri yanlis yazilmis olarak karsimiza gelebilir. Bunun icin index degerlerini en bastan duzeltilebiliriz

# yeni index listemizi olusturalim
newIndexList = ['Fur', 'Ham', 'Al', 'Ay']

# dataFrame e bunu ekleyelim
newDataFrame['Yeni Index'] = newIndexList

# dataFrame i yazdiralim
print(newDataFrame)
print('\n')

# Burada bunlar index olarak degil yeni bir kolon olarak eklendi. Simdi bu sorunu set_index() ile duzletelim
# Ana data uzeirnde degistirmek icin opsiyon olarak inplace ekliyorum
newDataFrame.set_index('Yeni Index', inplace = True)
print(newDataFrame)

# Bakalim indexlere erisim yapabiliyor muyuz
newDataFrame.loc['Fur']

             Yas  Calisma Saati  Emeklilik Yasi Yeni Index
Furkan  0.624137       0.540949        1.248274        Fur
Hamza   0.685438       0.694400        1.370876        Ham
Ali     0.670241       0.719130        1.340481         Al
Ayse    0.858056       0.861951        1.716112         Ay


                 Yas  Calisma Saati  Emeklilik Yasi
Yeni Index
Fur         0.624137       0.540949        1.248274
Ham         0.685438       0.694400        1.370876
Al          0.670241       0.719130        1.340481
Ay          0.858056       0.861951        1.716112

Yas               0.624137
Calisma Saati     0.540949
Emeklilik Yasi    1.248274
Name: Fur, dtype: float64

In [23]:
'''
elimizde daha farkli bir veri olsun
___________________________________
        | guclu sirin  | 12
sirinler| sirine       | 13
        | tembel sirin | 15
-----------------------------------
        | balbazar | 32
pokemon | pikachu  | 13
        | squirell | 23
___________________________________

Burada gozuktu uzere [sirinler] ve [pokemon] gruplarina ait kisiler var. Simdi bunlar ile islemler yapalim
'''

# Sirinler ve pokemon icin ilkIndexler olarak tanim yapiyoruz
ilkIndexler = ['sirinler', 'sirinler', 'sirinler', 'pokemon', 'pokemon', 'pokemon']

# icerdekiler icin icIndex olusturup tanim yapiyoruz
icIndexler = ['Guclu Sirin', 'Sirine', 'Tembel Sirin', 'Balbazar', 'Pikachu', 'Squirell']

# simdi ise bu iki index'in birlesimini sonra ise datalari olusturmamiz gerekiyo
birlesmisIndex = list(zip(ilkIndexler, icIndexler)) # zip() 2 arrayi birlestirmeye yarar

birlesmisIndex

[('sirinler', 'Guclu Sirin'),
 ('sirinler', 'Sirine'),
 ('sirinler', 'Tembel Sirin'),
 ('pokemon', 'Balbazar'),
 ('pokemon', 'Pikachu'),
 ('pokemon', 'Squirell')]

In [24]:
# simdi bu iki degerin multi(coklu) index oldugunu tanitalim
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)
birlesmisIndex

MultiIndex([('sirinler',  'Guclu Sirin'),
            ('sirinler',       'Sirine'),
            ('sirinler', 'Tembel Sirin'),
            ( 'pokemon',     'Balbazar'),
            ( 'pokemon',      'Pikachu'),
            ( 'pokemon',     'Squirell')],
           )

In [25]:
# verilerimizi yazalim
myList = [[40, 'A'], [30, 'B'], [20, 'C'], [10, 'D'], [9, 'E'], [8, 'F']]

# numpy dizisine cevirebiliriz dilersek
myNpList = np.array(myList)

# simdi de bunu dataFrame icine alalim
# datamiz numpy dizisi, index degerimiz multiindex ve kolon adlari yazilsin
myDfList = pd.DataFrame(data = myNpList, index = birlesmisIndex, columns = ['Yas', 'Meslek'])
myDfList

                      Yas Meslek
sirinler Guclu Sirin   40      A
         Sirine        30      B
         Tembel Sirin  20      C
pokemon  Balbazar      10      D
         Pikachu        9      E
         Squirell       8      F

In [26]:
# simdi biraz da verilere erisim icin bu dataFrame i biraz kurcalayalim
print(myDfList.loc['sirinler'])
print('\n')

print(myDfList.loc['pokemon'].loc['Pikachu'])
print('\n')

# dilersek indexlere de baslik ekleyebiliriz
myDfList.index.names = ['Film Ad', 'Karakter']
myDfList

             Yas Meslek
Guclu Sirin   40      A
Sirine        30      B
Tembel Sirin  20      C


Yas       9
Meslek    E
Name: Pikachu, dtype: object

                      Yas Meslek
Film Ad  Karakter
sirinler Guclu Sirin   40      A
         Sirine        30      B
         Tembel Sirin  20      C
pokemon  Balbazar      10      D
         Pikachu        9      E
         Squirell       8      F

## Bu kisimdan sonrasi daha cok pratik ve kisayol fonksiyonlar ile alakali

# Operasyonlar

### Eksik Veri

In [27]:
# veri olusturalim
sozlukVerisi = {'Istanbul' : [30,29,np.nan], 'Ankara' : [20,np.nan,29], 'Izmir' : [40,39,38]} # np.nan ifadesi bos oldugu anlamina gelir
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [28]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    29.0     38

In [29]:
# olmayan verileri silebiliriz
# dropna() ile eger bir satir da veri yoksa o satiri komple siler
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [30]:
# dropna() icine axis degerini belirterek satir mi sutun mu silecegimiz belirtebiliriz
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [31]:
# once 2 nan bulunan yeni veri olusturalim 
yeniVeri = {'Istanbul' : [30,29,np.nan], 'Ankara' : [20,np.nan,29], 'Izmir' : [40,39,38], 'Antalya' : [45,np.nan,np.nan]} # np.nan ifadesi bos oldugu anlamina gelir
yeniHavaDurumuDataFrame = pd.DataFrame(yeniVeri)

yeniHavaDurumuDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    29.0     38      NaN

In [32]:
# belirtilen kosulda ve sayida nan varsa silsin ama 1 tane varsa silmesin
# thresh = x, x veri ve uzeri sayida varsa silsin (axis = 1 dedik ve sutundaki 2 ve ustu eksikleri silecek yani Antalya)
yeniHavaDurumuDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    29.0     38

In [33]:
# nan olan her yere bir veri atayabiliriz istersek. Bunun icin fillna() kullanilir
# nan olan her yere 10 atayalim
yeniHavaDurumuDataFrame.fillna(10)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    10.0     39     10.0
2      10.0    29.0     38     10.0

### groupby() = gruplama icin kullancaz

In [34]:
# bir data olusturalim
maasSozlugu = {'Departmanlar' : ['Yazilim', 'Yazilim', 'Pazarlama', 'Pazarlama', 'Hukuk', 'Hukuk'],
               'Calisan Ismi' : ['Ahmet', 'Mehmet', 'Furkan', 'Hamza', 'Zeynep', 'Fatma'],
               'Maas' : [100, 150, 200, 250, 400, 500]
              }

# datayi dataFrame cevirelim
maasDataFrame = pd.DataFrame(maasSozlugu)
maasDataFrame

  Departmanlar Calisan Ismi  Maas
0      Yazilim        Ahmet   100
1      Yazilim       Mehmet   150
2    Pazarlama       Furkan   200
3    Pazarlama        Hamza   250
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [35]:
# ayni departmanda calisanlari kendi icinde gruplandiralim
# group bu neye gore gruplamasi gerektigi yazilir
grupObjesi = maasDataFrame.groupby('Departmanlar')

In [36]:
# simdi olusturdugumuz grupObjesi isimli degiskenle neler yapilabildigine bakalim
# hangi departmanda kac kisi calisiyor
grupObjesi.count()

              Calisan Ismi  Maas
Departmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazilim                  2     2

In [37]:
# departmandakilerin ortalama maasi
grupObjesi.mean()

               Maas
Departmanlar
Hukuk         450.0
Pazarlama     225.0
Yazilim       125.0

In [38]:
# max maaslar
grupObjesi.max()

             Calisan Ismi  Maas
Departmanlar
Hukuk              Zeynep   500
Pazarlama           Hamza   250
Yazilim            Mehmet   150

In [39]:
# min maaslar
grupObjesi.min()

             Calisan Ismi  Maas
Departmanlar
Hukuk               Fatma   400
Pazarlama          Furkan   200
Yazilim             Ahmet   100

In [40]:
# data hakkindaki tum veriler
grupObjesi.describe()

              Maas
             count   mean        std    min    25%    50%    75%    max
Departmanlar
Hukuk          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama      2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
Yazilim        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

### concat() = veri birlestirme

In [41]:
# 3 farkli yerden data gelsin. Ve bunlari birlestirip tek bir dataFrame yapalim
sozluk1 = {'Isim' : ['Ahmet', 'Mehmet', 'Zeynep', 'Atil'],
           'Spor' : ['Kosu', 'Yuzme', 'Kosu', 'Basketbol'],
           'Kalori' : [100, 200, 300, 400]
          }

sozluk2 = {'Isim' : ['Osman', 'Levent', 'Furkan', 'Fatma'],
           'Spor' : ['Kosu', 'Yuzme', 'Kosu', 'Basketbol'],
           'Kalori' : [150, 260, 320, 410]
          }

sozluk3 = {'Isim' : ['Hamza', 'Betul', 'Duygu', 'Ayse'],
           'Spor' : ['Kosu', 'Yuzme', 'Badminton', 'Tenis'],
           'Kalori' : [101, 203, 305, 407]
          }

# bunlari dataFrame e atalim
dataFrame1 = pd.DataFrame(data = sozluk1, index = [0,1,2,3])
dataFrame2 = pd.DataFrame(data = sozluk2, index = [4,5,6,7])
dataFrame3 = pd.DataFrame(data = sozluk1, index = [8,9,10,11])

In [42]:
# datalarimizi gorelim
print(dataFrame1)
print('\n')
print(dataFrame2)
print('\n')
print(dataFrame3)

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400


     Isim       Spor  Kalori
4   Osman       Kosu     150
5  Levent      Yuzme     260
6  Furkan       Kosu     320
7   Fatma  Basketbol     410


      Isim       Spor  Kalori
8    Ahmet       Kosu     100
9   Mehmet      Yuzme     200
10  Zeynep       Kosu     300
11    Atil  Basketbol     400

In [43]:
# bu verileri birlestirelim
newDataFrame = pd.concat([dataFrame1, dataFrame2, dataFrame3]) # burada axis belirtilebilir. Fakat bu verisetinde axis = 1 kullanmak sacma bir sonuc verir
newDataFrame

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     150
5   Levent      Yuzme     260
6   Furkan       Kosu     320
7    Fatma  Basketbol     410
8    Ahmet       Kosu     100
9   Mehmet      Yuzme     200
10  Zeynep       Kosu     300
11    Atil  Basketbol     400

### merge() = birlestirme islemi

In [44]:
# elimizde ad ve spor kolonlu bir data olsun. Ve bir de ayni ad ve kalori kalori kolonu olan data. Bu ikisini birlestirelim
# verilerimi olusturalim
yeniSozluk1 = {'Isim' : ['Furkan', 'Hamza', 'Duygu', 'Ayse'],
               'Spor' : ['Kosu', 'Yuzme', 'Badminton', 'Tenis'],
          }

yeniSozluk2 = {'Isim' : ['Furkan', 'Hamza', 'Duygu', 'Ayse'],
               'Kalori' : [101, 203, 305, 407]
          }
# dataFrame e atalim verileri
yeniDataFrame1 = pd.DataFrame(yeniSozluk1)
yeniDataFrame2 = pd.DataFrame(yeniSozluk2)

# verilerimizi yazdiralim
print(yeniDataFrame1)
print('\n')
print(yeniDataFrame2)

     Isim       Spor
0  Furkan       Kosu
1   Hamza      Yuzme
2   Duygu  Badminton
3    Ayse      Tenis


     Isim  Kalori
0  Furkan     101
1   Hamza     203
2   Duygu     305
3    Ayse     407

In [45]:
# burada ortak kolon mevcut. Icerigi de ayni. Bu iki veriyi buna gore birlestirelim
#         data 1     |      data 2    |    ortak verilerin oldugu kolon = merge kullanimi
newData = pd.merge(yeniDataFrame1, yeniDataFrame2, on = 'Isim')

# birlesmis veriyi yazdiralim
newData

     Isim       Spor  Kalori
0  Furkan       Kosu     101
1   Hamza      Yuzme     203
2   Duygu  Badminton     305
3    Ayse      Tenis     407

#### Merge() ortak kolonlari tespit edip birlestirme yaparken\ concat() dogrudan istenilen axis boyunca birlestirme yapar

In [46]:
# ileri operasyonlarla islem yapmak icin yeni bi veri olusturalim
maasSozluk = {'Isim' : ['Furkan', 'Hamza', 'Duygu', 'Ayse'],
               'Departman' : ['Yazilim', 'Satis', 'Pazarlama', 'Yazilim'],
               'Maas' : [101, 203, 305, 407]
          }

# dataFrame olusturalim
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

     Isim  Departman  Maas
0  Furkan    Yazilim   101
1   Hamza      Satis   203
2   Duygu  Pazarlama   305
3    Ayse    Yazilim   407

In [47]:
# sirkette kac departman olduguna bakalim. Unique() essiz degerleri bize verir
maasDataFrame['Departman'].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [48]:
# kac farkli departman oldugunu nunique() ile getirebiliriz
maasDataFrame['Departman'].nunique()

3

In [49]:
# hangi departmanda kac kisi olduguna bakalim value_counts()
maasDataFrame['Departman'].value_counts()

Yazilim      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [50]:
# her calisanin maasini 0.6 ile carpalim ve yeni maas yapalim
def newMaas(maas):
    return maas * 0.6

# apply() uygula anlamina gelen fonksyiondur
maasDataFrame['Maas'].apply(newMaas)

0     60.6
1    121.8
2    183.0
3    244.2
Name: Maas, dtype: float64

## disardan veri cekmek

In [54]:
dosya = pd.read_excel('pandas.xlsx')
dataFrameDosya = dosya

In [55]:
dataFrameDosya

  Unnamed: 0  Maas   Yas  Departman
0     Furkan   100  23.0    Yazilim
1      Hamza   150  20.0      Satis
2       Ayse   200  34.0        NaN
3      Fatma   250  20.0  Pazarlama
4     Mehmet   300   NaN     Finans
5     Hatice   350  40.0      Hukuk

In [61]:
# NaN degerleri silelim
duzeltilismExcel = dataFrameDosya.dropna()
duzeltilismExcel

  Unnamed: 0  Maas   Yas  Departman
0     Furkan   100  23.0    Yazilim
1      Hamza   150  20.0      Satis
3      Fatma   250  20.0  Pazarlama
5     Hatice   350  40.0      Hukuk

In [62]:
# bunu dosyaya yazalim
duzeltilismExcel.to_excel('Duzenlenmis_excel.xlsx')

##  read_csv \ read_excel vs okuma
## to_csv \ to_excel yazma